html/20231128T132521--move-models-from-one-app-to-another__django_sql.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://arvydasg.github.io/devnotes/html/rss.xml"
      title="RSS feed for https://arvydasg.github.io/devnotes/html">
<title>move models from one app to another</title>
<meta name="author" content="Arvydas Gasparavicius">
<meta name="referrer" content="no-referrer">
<meta name="viewport" content="initial-scale=1,width=device-width,minimum-scale=1">
<link rel="stylesheet" href="../static/style.css"/>
<link rel="icon" href="../static/ag.ico">
</head>
<body>
<div id="preamble" class="status"><br>preamble here yo</br></div>
<div id="content">
<div class="post-date">15 Dec 2023</div><h1 class="post-title"><a href="https://arvydasg.github.io/devnotes/html/20231128T132521--move-models-from-one-app-to-another__django_sql.html">move models from one app to another</a></h1>
<p>
Inspiration -
<a href="https://stackoverflow.com/questions/25648393/how-to-move-a-model-between-two-django-apps-django-1-7">https://stackoverflow.com/questions/25648393/how-to-move-a-model-between-two-django-apps-django-1-7</a>
</p>

<p>
I had to move the model from one app to another.
</p>

<p>
Tried various methods, such as:
</p>
<ul class="org-ul">
<li>adding class Meta: db<sub>table</sub> = 'app1<sub>yourmodel</sub>',</li>
<li>migrations.SeparateDatabaseAndState,</li>
<li>renaming the table name by hand,</li>
<li>copying the data during the migration process by running raw sql queries with RunSQL,</li>
<li>etc</li>
</ul>

<p>
But after each case I would face some kind of error would occur. I will describe
a method that I have used and that has worked for me just fine.
</p>

<p>
It was very good to practice this in my DEV environment, having copies of
sqlite3 DB files and to be able to visually see the content of the DB as I was
doing this.
</p>

<p>
But for those that do not have access to sqlite3 DB file or can not preview
their content in the GUI as I could in VScode or in sqlitebrowser, I will write
as detailed instructions as I can below. They helped me to execute the same
commands in my PROD server afterwards(did not have a gui as well).
</p>

<blockquote>
<p>
note: you can ignore the <code>--settings=settings.development</code> everywhere you see
it, you will not need it, it is just a part of my config, because I have split
my Django settings.py file into dev and prod. TOOD
</p>
</blockquote>

<p>
If you see a command like such:
</p>
<div class="org-src-container">
<pre class="src src-bash">python manage.py makemigrations base_app --settings=settings.development
</pre>
</div>

<p>
It means that you have to run your command like that(and change the "base<sub>app</sub>"
to your app name):
</p>
<div class="org-src-container">
<pre class="src src-bash">python manage.py makemigrations base_app
</pre>
</div>
<div class="taglist"><a href="https://arvydasg.github.io/devnotes/html/tags.html">Tags</a>: <a href="https://arvydasg.github.io/devnotes/html/tag-django.html">django</a> <a href="https://arvydasg.github.io/devnotes/html/tag-sql.html">sql</a> </div></div>
<div id="postamble" class="status"><br>postamble in he house</br></div>
</body>
</html>
